# Cross Validation

## Data Prep

In [1]:
import pandas as pd
import env

url = f'mysql+pymysql://{env.user}:{env.password}@{env.host}/numbers'

In [2]:
df = pd.read_sql('SELECT * FROM numbers_with_more_groups', url)
df

    n category supergroup
0   1        a        one
1   2        b        two
2   3        c        one
3   4        a        two
4   5        b        one
5   6        c        two
6   7        a        one
7   8        b        two
8   9        c        one
9  10        a        two

We can use `.transform` to return a dataframe / series with the same number of rows as the original dataframe. This means we can use `.transform` to add a new column to our data frame, based on some sub-group aggreate.

In [14]:
supergroup_means = df.groupby('supergroup').n.transform('mean')
df['supergroup_mean'] = supergroup_means
df

    n category supergroup  supergroup_mean
0   1        a        one                5
1   2        b        two                6
2   3        c        one                5
3   4        a        two                6
4   5        b        one                5
5   6        c        two                6
6   7        a        one                5
7   8        b        two                6
8   9        c        one                5
9  10        a        two                6

## Exercise

1. Obtain the `cars.csv` file from the [google classroom](https://classroom.google.com/u/1/c/Mjc3NjgxNDE5NjJa) and read it into python with pandas.
1. Create a feature named `gt_avg`, which should be either 1 or 0. The value should indicate whether or not a given price is greater than the average price for that car's combination of year, make, and model.
1. Drop the `Id`, `City`, and `Vin` columns.
1. Encode the categorical features as necessary. You might wish to use a `sklearn.preprocessing.LabelEncoder`.
1. Split the data into training and test sets.

In [34]:
cars = pd.read_csv('./cars.csv')
cars.columns = [col.lower() for col in cars]
print('%d rows X %d columns' % cars.shape)
cars.head()

297899 rows X 9 columns

,id,price,year,mileage,city,state,vin,make,model
0,1,16472,2015,18681,Jefferson City,MO,KL4CJBSBXFB267643,Buick,EncoreConvenience
1,2,15749,2015,27592,Highland,IN,KL4CJASB5FB245057,Buick,EncoreFWD
2,3,16998,2015,13650,Boone,NC,KL4CJCSB0FB264921,Buick,EncoreLeather
3,4,15777,2015,25195,New Orleans,LA,KL4CJASB4FB217542,Buick,EncoreFWD
4,5,16784,2015,22800,Las Vegas,NV,KL4CJBSB3FB166881,Buick,EncoreConvenience

In [23]:
cars['avg_saleprice'] = cars.groupby(['make', 'model', 'year']).price.transform('mean')

In [27]:
cars['gt_avg'] = (cars.price > cars.avg_saleprice).astype(int)

In [31]:
cars.drop(columns=['id', 'price', 'city', 'vin', 'avg_saleprice'], inplace=True)